Обработки/Reports/_ЗадолженностьКакВ502ф.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ЗадолженностьКакВ502ф</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ЗадолженностьКакВ502ф/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"ЗадолженностьКакВ502ф",
		"0.07",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.Настройки;

	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 					ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаДату", 						ЭтотОбъект.НаДату);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ГраницаОкончания", 				Новый Граница(КонецДня(ЭтотОбъект.НаДату), ВидГраницы.Включая));
		
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидыЗадолженностиСПредварительнымНачислением", 
																							Справочники.ВидыЗадолженности.ВидыЗадолженностиСПредварительнымНачислением(ЭтотОбъект.Организация, ЭтотОбъект.НаДату));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НКО_НКЦ", 						ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"));
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры
